// 1. მეტია (>)
console.log(10 > 5); // true

// 2. ნაკლებია (<)
console.log(3 < 7); // true

// 3. ტოლია (==)
console.log(4 == '4'); // true (შედარება მნიშვნელობით, ტიპს არ ამოწმებს)

// 4. ტოლია ტიპითაც და მნიშვნელობითაც (===)
console.log(4 === '4'); // false

// 5. არ არის ტოლი (!=)
console.log(8 != 6); // true

// 6. არ არის ტოლი ტიპითაც და მნიშვნელობითაც (!==)
console.log(5 !== '5'); // true

// 7. მეტია ან ტოლია (>=)
console.log(9 >= 9); // true

// 8. ნაკლებია ან ტოლია (<=)
console.log(2 <= 5); // true

// 9. სტრინგების შედარება (მახსოვრობის მიხედვით)
console.log("apple" < "banana"); // true

// 10. ლოგიკური გამოთქმა შედარებაში
console.log((3 + 2) > (1 + 1)); // true
