# მომხმარებლისგან რიცხვის შეყვანა
number = int(input("შეიყვანეთ რიცხვი: "))

# შემოწმება, არის თუ არა რიცხვი ლუწი
if number % 2 == 0:
    # თუ ლუწია, გავამრავლოთ 2-ზე
    print(number * 2)
else:
    # თუ კენტია, გამოიტანეთ "error"
    print("error")

#     როგორ მუშაობს ეს კოდი:
#1 პროგრამა მოითხოვს მომხმარებლისგან რიცხვის შეყვანას.
#2 რიცხვი ვამოწმებთ, არის თუ არა ის ლუწი (თუ 2-ს მიერ გამყოფდება).
#3 თუ ლუწია, მაშინ პროგრამა გამოაქვს მისი გაორმაგებული ვერსია.
#4 თუ კენტია, პროგრამა უბრალოდ აჩვენებს "error".
