#დავალება 1
#ბულეანი კოდი და ბინარული კოდი ორი განსხვავებული ტიპის მონაცემთა ჩანაწერის კოდირებაა,
#  რომელსაც ხშირად იყენებენ კომპიუტერულ მეცნიერებასა და ციფრული ტექნოლოგიების სფეროში.
#  ქვემოთ ვიხელმძღვანელებთ მათ განმარტებებს და ასევე გავაკეთებთ კომენტარების გამოყენებით, რომ გაგიზიაროთ მათი ძირითადი პრინციპები:
#ბულეანი კოდი
#ბულეანი კოდი არის მონაცემთა ტიპი,
#რომელიც შეიძლება ჰქონდეს მხოლოდ ორი მნიშვნელობა: True (მართალია) და False (ყალბი).
# ეს არის ლოგიკური სისტემის ნაწილი, რომელიც ძალიან მნიშვნელოვანია პროგრამირებაში და კომპიუტერულ ლოგიკაში.
# ბულეან კოდი ძირითადად გამოიყენება პირობების გადამოწმების, ლოგიკური ოპერაციების და ციფრული გადაწყვეტილებების მიღებისას
#ბულეან კოდში ორი ძირითადი მნიშვნელობაა: True და False -->
# ბულეან კოდით შესაძლებელია მართოს ლოგიკური ოპერაციები, როგორიცაა AND, OR და NOT 
# მაგალითი:
  #  let isDay = true; // ცვლადი, რომელიც გულისხმობს რომ დღის განმავლობაშია
   # if (isDay) {
     #   console.log("It's daytime!"); // თუ isDay ჭეშმარიტია, ეს შეტყობინება გამოიწვება

#დავალება2
#5 > 3 – ჭეშმარიტია, რადგან 5 უფრო დიდია 3-ზე.
#10 > 10 – ყალბია, რადგან 10 არ არის მეტი 10-ზე.
#8 > 7 – ჭეშმარიტია, რადგან 8 უფრო დიდია 7-ზე.
#-2 > -5 – ჭეშმარიტია, რადგან -2 უფრო დიდია -5-ზე.
#100 > 50 – ჭეშმარიტია, რადგან 100 უფრო დიდია 50-ზე.
#2. >= (მეტი ან თანაბარი ვიდრე)
#7 >= 5 – ჭეშმარიტია, რადგან 7 მეტი ან თანაბარია 5-ზე.
#10 >= 10 – ჭეშმარიტია, რადგან 10 თანაბარია 10-ზე.
#3 >= 6 – ყალბია, რადგან 3 ნაკლებია 6-ზე.
#0 >= -1 – ჭეშმარიტია, რადგან 0 უფრო დიდია ან თანაბარია -1-ს.
#15 >= 15 – ჭეშმარიტია, რადგან 15 თანაბარია 15-ზე.
#3. < (ნაკლები ვიდრე)
#4 < 6 – ჭეშმარიტია, რადგან 4 ნაკლებია 6-ზე.
#-3 < 2 – ჭეშმარიტია, რადგან -3 ნაკლებია 2-ზე.
#8 < 5 – ყალბია, რადგან 8 უფრო დიდია 5-ზე.
#7 < 7 – ყალბია, რადგან 7 არ არის ნაკლები 7-ზე.
#-10 < 0 – ჭეშმარიტია, რადგან -10 ნაკლებია 0-ზე.
#4. <= (ნაკლები ან თანაბარი ვიდრე)
#5 <= 7 – ჭეშმარიტია, რადგან 5 ნაკლებია ან თანაბარია 7-ს.
#10 <= 10 – ჭეშმარიტია, რადგან 10 თანაბარია 10-ზე.
#3 <= 2 – ყალბია, რადგან 3 მეტი არის 2-ზე.
#-1 <= 0 – ჭეშმარიტია, რადგან -1 ნაკლებია ან თანაბარია 0-ს.
#15 <= 20 – ჭეშმარიტია, რადგან 15 ნაკლებია ან თანაბარია 20-ს.
#5. != (შეიცვლება)
#5 != 3 – ჭეშმარიტია, რადგან 5 არ არის თანაბარი 3-ს.
#8 != 8 – ყალბია, რადგან 8 თანაბარია 8-ზე.
#-4 != -4 – ყალბია, რადგან -4 თანაბარია -4-ს.
#100 != 50 – ჭეშმარიტია, რადგან 100 არ არის თანაბარი 50-ს.
#7 != 9 – ჭეშმარიტია, რადგან 7 არ არის თანაბარი 9-ს.
#6. == (ტოლობა)
#10 == 10 – ჭეშმარიტია, რადგან 10 თანაბარია 10-ზე.
#5 == 7 – ყალბია, რადგან 5 არ არის თანაბარი 7-ს.
#-2 == -2 – ჭეშმარიტია, რადგან -2 თანაბარია -2-ს.
#0 == 1 – ყალბია, რადგან 0 არ არის თანაბარი 1-ს.
#15 == 15 – ჭეშმარიტია, რადგან 15 თანაბარია 15-ს.
