#დავალება 1

    #              +------------------------+
    #              |    შემავალი ინფორმაცია   |
    #              +------------------------+
    #                           |
    #                           v
    #              +------------------------+
    #              |   პირობა: num > 10     |
    #              +------------------------+
    #                           |
    #            +--------------+--------------+
    #            |                             |
    #            v                             v
    #   +-----------------+           +----------------------+
    #   |  "ნომერი მეტია   |           |  "ნომერი ნაკლებია   |
    #   |   ათზე"         |           |   ან უდრის ათს"     |
    #   +-----------------+           +----------------------+

# მაგალითი	შედეგი
# 5 > 3	    True
# 10 > 7	    True
# 15 > 20	    False
# 8 > 5	    True
# 12 > 12	    False
# 100 > 50	True
# 0 > -1	    True
# 4.5 > 4	    True
# 20 > 19	    True
# 3 > 9	    False

#დავალება 2

# სახელი, რომელიც უნდა დაბეჭდოს
name = "თქვენი სახელი"  # ამ ადგილას ჩაწერეთ თქვენი სახელი

# for ციკლი 10-ჯერ
for i in range(10):
    print(name)

name = "გიორგი"

for i in range(10):
    print(name)

# გიორგი
# გიორგი
# გიორგი
# გიორგი
# გიორგი
# გიორგი
# გიორგი
# გიორგი
# გიორგი
# გიორგი

#დავალება 3

# სასურველი რიცხვი
answer = 7  # აქ შეგიძლიათ ჩაწეროთ ნებისმიერი რიცხვი

# მომხმარებლისთვის რიცხვის შეყვანა და while ციკლი
user_input = None

while user_input != answer:
    user_input = int(input("გამოიცანით რიცხვი: "))  # მომხმარებელს ვთხოვთ რიცხვის შეყვანას

print("თქვენ სწორად გამოიცანით!")

#დავალება 4

# მომხმარებლისგან რიცხვის შეყვანა
user_input = int(input("შეიტანეთ რიცხვი: "))  # ვთხოვთ მომხმარებელს რიცხვის შეყვანას

# შევამოწმოთ რიცხვის მნიშვნელობა
if user_input >= 100:
    print("big number")  # თუ რიცხვი მეტია ან უდრის 100-ს
else:
    print("small number")  # თუ რიცხვი ნაკლებია 100-ზე
