#2) მე როგორც ჩამოგიწერეთ for ციკლის შექმნის წესი, თქვენც მასე ჩამოწერეთ ნაწილებად და დეტალურად ახსენით თითოეული ეტაპი
#3) შექმენით შემდეგი ხუთი დიაპაზონი:

# 1-დან 4-ის ჩათვლით,
# 10-დან 20-მდე,
# 2-დან 7-ის ჩათვლით,
# 3-დან 4-ის ჩათვლით,
# 30-დან 50-ის ჩათვლით

#4) for ციკლის გამოყენებით:

# 20-ჯერ დაბეჭდეთ თქვენი სახელი,
# 30-ჯერ დაბეჭდეთ თქვენი გვარი,
# 50-ჯერ დაბეჭდეთ თქვენი ასაკი,

#5) for ციკლის გამოყენებით, 10-ჯერ შეეკითხეთ მომხმარებელს სახელი და დაბეჭდეთ შედეგი

# დავალება 1
for i in range(1,5):
    print(i)

for i in range(10,21):
    print(i)

for i in range(2,8):
    print(i)

for i in range(3,5):
    print(i)

for i in range(30,51):
    print(i)

# დავალება 2

for i in range(20):
    print("luka")

for i in range(30):
    print("tomoshevski")

for i in range(5):
    print(11)

# დავალება 3
name = input("enter your name: ")
for i in range(10):
    print(name)



    