#დავალება 1 N2

for i in range(5):
    print(i)

count = 0
while count < 5:
    print(count)
    count += 1

#დავალება 2 N3

#Decrease (შეწყვეტა, შემცირება)

# გამოყენება: როდესაც რაიმე რაოდენობა ნაკლებდება, მაგალითად: "განაკვეთის შემცირება."
# მაგალითი: "ბიუჯეტში შემცირება იქნება საჭირო."

# #Increase (გაზრდა)

# გამოყენება: როდესაც რაიმე რაოდენობა იმატებს, მაგალითად: "პროდუქციის გაზრდა."
# მაგალითი: "სამუშაო საათების გაზრდა დაგვჭირდება."

# ინკრემენტაცია (გაზრდა)

# გამოყენება: აღნიშნავს პროცესს, როდესაც რაიმე რაოდენობა სისტემატურად იზრდება.
# მაგალითი: "პროექტის ინკრემენტაცია სჭირდება მეტი რესურსი."

# დეკრემენტაცია (შეწყვეტა, შემცირება)

# გამოყენება: აღნიშნავს პროცესს, როდესაც რაიმე რაოდენობა სისტემატურად მცირდება.
# მაგალითი: "ძირითადი ხარჯების დეკრემენტაცია აუცილებელია."

# ინკრემენტი (რამდენითაც გაიზარდა)

# გამოყენება: აღნიშნავს რაოდენობას, რამდენითაც გაიზარდა რაიმე.
# მაგალითი: "ჩვენმა გუნდმა პროექტის ინკრემენტი 20% შეადგინა."

# დეკრემენტი (რამდენითაც შემცირდა)

# გამოყენება: აღნიშნავს რაოდენობას, რამდენითაც შემცირდა რაიმე.
# მაგალითი: "ბიუჯეტის დეკრემენტი 10%-ით განისაზღვრება."

#დავალება 3 N5

user_password = input("გთხოვთ, შეიყვანეთ პაროლი: ")

while user_password != "12345678":
    print("არასწორი პაროლი. სცადეთ კვლავ.")
    user_password = input("გთხოვთ, შეიყვანეთ პაროლი: ")

print("პაროლი წარმატებით მიღებულია!")

#დავალება 4 N6

num1 = 0  # ცვლადის შექმნა და 0-ს განულება

while num1 < 10:  # სანამ num1 ნაკლებია 10-ზე
    print(num1)  # დაბეჭდეთ num1-ის მნიშვნელობა
    num1 += 1  # num1-ის ინკრემენტაცია 1-ით

#დავალება 5 N7

num2 = 10  # ცვლადის შექმნა და 10-ს განულება

while num2 < 100:  # სანამ num2 ნაკლებია 100-ზე
    print(num2)  # დაბეჭდეთ num2-ის მნიშვნელობა
    num2 += 5  # num2-ის ინკრემენტაცია 5-ით

#დავალება 6 N8

num3 = 20  # ცვლადის შექმნა და 20-ს განულება

while num3 > 10:  # სანამ num3 მეტი იქნება 10-ზე
    print(num3)  # დაბეჭდეთ num3-ის current მნიშვნელობა
    num3 -= 1  # num3-ის დეკრემენტაცია 1-ით

#დავალება 6 N9

num4 = 50  # ცვლადის შექმნა და 50-ს განულება

while num4 < 100:  # num4 ნაკლებია 100-ზე
    print(num4)  # დაბეჭდეთ num4-ის current მნიშვნელობა
    num4 += 50  # num4-ის ინკრემენტაცია 50-ით

#დავალება 7 N10

#პირობა არასდროს ხდება ყალბი:
while True:  # ეს პირობა ყოველთვის მართალია
    print("ეს არის უსასრულო ციკლი")

#შეცდომა ციკლის პირობებში:
count = 0
while count < 10:  # თუ ამ პირობაში არ ვზრდით count-ს
    print(count)
