// Prompt-ით შემოგვაქვს მონაცემი (საწყისად ეს იქნება სტრინგი)
let userInput = prompt("შეიყვანე რაიმე რიცხვი:");

// ვბეჭდავთ შემოტანილ მნიშვნელობას და მის მონაცემთა ტიპს
console.log("შემოიტანე:", userInput);
console.log("მონაცემთა ტიპი:", typeof userInput);

// ვქმნით ახალ ცვლადს, სადაც ვცვლით სტრინგს რიცხვად
let numberInput = Number(userInput);

// ვბეჭდავთ ახალ ცვლადს და მის მონაცემთა ტიპს
console.log("ახალი ცვლადი:", numberInput);
console.log("ახალი ცვლადის მონაცემთა ტიპი:", typeof numberInput);


//console-ში გამოიტანს თუ რიცხვ 42-ს შემოვიტანთ
//შემოვიტანეთ: 42
//მონაცემთა ტიპი: string
//ახალი ცვლადი: 42
//ახალი ცვლადის მონაცემთა ტიპი: number
