# დავალება 1: ტოლია თუ არა რიცხვი 10-ს
# ამოცანა:
# შექმენი პროგრამა, რომელიც მომხმარებელს სთხოვს რიცხვის შეყვანას და შეამოწმებს,
# არის თუ არა ეს რიცხვი ზუსტად 10-ის ტოლი. პროგრამამ უნდა დაბეჭდოს True თუ ტოლია და False თუ არა. 

number = int(input("Please enter a number: "))
print(number == 10)

# დავალება 2: რიცხვი ლუწია თუ კენტი
# ამოცანა:
# შექმენი პროგრამა, რომელიც მომხმარებელს სთხოვს რიცხვის შეყვანას და შეამოწმებს,
# ლუწია თუ კენტი რიცხვი. პროგრამამ უნდა დაბეჭდოს True, თუ რიცხვი ლუწია და False, თუ კენტი.

number = int(input("Please enter a number: "))

print(number % 2 == 0)

# დავალება 3: რიცხვების შუალედი
# ამოცანა:
# შექმენი პროგრამა, რომელიც მომხმარებელს სთხოვს რიცხვის შეყვანას და შეამოწმებს,
# არის თუ არა ეს რიცხვი 50-სა და 100-ს შორის (ორივე ჩათვლით). პროგრამამ უნდა დაბეჭდოს True ან False. 

number = int(input("Please enter a number: "))

print(number >= 50 and number <= 100)

# დავალება 4: განსხვავებული რიცხვები
# ამოცანა:
# შექმენი პროგრამა, რომელიც მომხმარებელს სთხოვს სამი რიცხვის შეყვანას და შეამოწმებს,
# არის თუ არა ეს სამი რიცხვი განსხვავებული ერთმანეთისგან.
# პროგრამამ უნდა დაბეჭდოს True თუ ყველა რიცხვი განსხვავებულია და False თუ რომელიმე მაინც ტოლია.

number1 = int(input("Please enter a number: "))
number2 = int(input("Please enter a number: "))
number3 = int(input("Please enter a number: "))

print(number1 == number2 == number3)

# დავალება 5: მომხმარებლის სახელი და პაროლი
# ამოცანა:
# შექმენი პროგრამა, რომელიც მომხმარებელს სთხოვს მომხმარებლის სახელის და პაროლის შეყვანას.
# პროგრამამ უნდა შეამოწმოს, სწორია თუ არა შეყვანილი მონაცემები. სწორად მიჩნეული იქნება,
# თუ სახელი არის "admin" და პაროლი "12345". პროგრამამ უნდა დაბეჭდოს True ან False.

user_name = input("Please enter a username: ")
password = input("Please enter a password: ")

print(user_name == "admin" and password == "12345")