import time
import os

messages = [
    "⭐ მამა ისევ ჩვენთანაა…",
    "⭐ ყოველ დღე… ყოველ წამს…",
    "⭐ შენს ღიმილში...",
    "⭐ შენს სიკეთეში...",
    "⭐ შენს ძალაში...",
    "⭐ ამ ყველაფერში მისი ნაწილი ბრუნდება.",
    "",
    "❤️ დედიკოსთვის:",
    "მამას ძალიან ეამაყებოდა ასეთი კარგი შვილი რომ ხარ.",
    "ის ყოველთვის გიცხედთ… და ძალიან უყვარხართ ორივე."
]

for msg in messages:
    os.system("cls" if os.name == "nt" else "clear")
    print("\n" * 3)
    print(msg.center(80))
    time.sleep(2)
